Tekla Open API Reference for Tekla Structures 2025
StructuresDialogFilterAttribute Class
 The StructuresDialogFilterAttribute class specifies the attribute name for which the value of the attributed property will be used as a filter in Tekla Structures. The return type of the attributed property must be boolean. The apply and modify operations will only commit/update those attributes which either do not have a filter property defined or the value of the filter property is true.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Dialog.StructuresDialogFilterAttribute
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class StructuresDialogFilterAttribute : Attribute
Public NotInheritable Class StructuresDialogFilterAttribute
	Inherits Attribute
The StructuresDialogFilterAttribute type exposes the following members.
Constructors
Name | Description
StructuresDialogFilterAttribute
 Initializes a new StructuresDialogFilterAttribute instance.
Top
Properties
Name | Description
AttributeName
 Gets the attribute name of the property.
Top
Methods
Name | Description
ToString
 Returns a string that represents the current StructuresDialogFilterAttribute object.
 (Overrides Object.ToString().)
Top
See Also
Reference
Tekla.Structures.Dialog Namespace